Repository: PerchunPak/pinger-bot
Catalog: docs/locale/*/LC_MESSAGES/pages/contributing.po
Languages: ru, uk_ua

source: Contributing
ru: Как Помочь
uk_ua: Як Допомогти

source: This file is describing our code style and some other documentation about contributions. You must read it before your first contribution.
ru: Этот файл описывает наш стиль кода и немного другой документации про внесение своей помощи в проект. Вы должны прочитать этот файл перед вашим первым изменением.
uk_ua: Цей файл описує стиль нашого коду та деяку іншу документацію про внески. Ви повинні прочитати його перед тим, як зробити свій перший внесок.

source: Also note that this all is just recommendations, you can use anything in some cases, if it will be better than solution that we propose here. However, we will prefer these recommendations when we will review your contribution.
ru: Также учитывайте что это все только рекомендации, вы можете использовать что угодно в некоторых случаях, если это будет лучше, чем то что мы предлагаем тут. Однако мы будем давать приоритет этим рекомендациям при рассмотрении ваших изменений.
uk_ua: Також зверніть увагу, що це все лише рекомендації, ви можете використовувати будь-що в окремих випадках, якщо це буде краще, ніж рішення, які ми тут пропонуємо. Однак, ми віддамо перевагу саме цим рекомендаціям, коли будемо розглядати ваш внесок.

source: This "magic" command collects almost all of our CI. If you're on Windows, try `Chocolatey <https://chocolatey.org>`_ to run ``make``.
ru: Эта "магическая" команда собирает в себе почти все наше CI. Если вы на Windows, попробуйте `Chocolatey <https://chocolatey.org>`_ для запуска ``make``.
uk_ua: Цією "чарівною" командою збираються майже всі наші CI. Якщо ви на Windows, спробуйте `Chocolatey <https://chocolatey.org>`_\ , щоб запустити ``make``.

source: Also, because of conflict between ``pytest-testmon`` and ``pytest-cov`` we use option ``--no-cov`` in ``pytest``\ , so in this way we give prioritize to ``pytest-testmon``. If you want to generate a report with ``pytest-cov``\ , use ``make test ci=1``.
ru: Так же из-за конфликта между ``pytest-testmon`` и ``pytest-cov`` мы используем опцию ``--no-cov`` в ``pytest`` и таким образом даем приоритет ``pytest-testmon``. Если вы хотите сгенерировать отчет с помощью ``pytest-cov``\ , используйте ``make test ci=1``.
uk_ua: Також через конфлікт між ``pytest-testmon`` і ``pytest-cov`` ми використовуємо опцію ``--no-cov`` у ``pytest``\ , таким чином ми даємо пріоритет ``pytest-testmon``. Якщо ви хочете згенерувати доповідь за допомогою ``pytest-cov``\ , використайте ``make test ci=1``.

source: Furthermore, you can bind ``make test`` (plus some additional useful checks) to run on every commit, so you will always sure that CI will never fail. Just run ``pre-commit install``.
ru: Более того, вы можете привязать ``make test`` (плюс несколько дополнительных полезных проверок) для запуска при каждом коммите, так что вы всегда будете уверены, что CI никогда не провалиться. Просто запустите ``pre-commit install``.
uk_ua: Крім того, ви можете прив'язати ``make test`` (плюс деякі додаткові корисні перевірки) до запуску при кожному коміті, так що ви завжди будете впевнені, що CI ніколи не провалиться. Просто запустіть ``pre-commit install``.

source: Code Style
ru: Стиль Кода
uk_ua: Стиль Коду

source: We use ``black`` for almost all style control. We're also trying to use formatters instead of linters, where it is possible.
ru: Мы используем ``black`` для почти всего контроля стиля. Мы также пытаемся использовать форматеры вместо линтеров, где это возможно.
uk_ua: Ми використовуємо ``black`` майже для всього контролю стилів. Ми також намагаємося використовувати форматери замість літерів, де це можливо.

source: Furthermore, we also have some rules that ``black`` doesn't cover. It includes:
ru: Более того, мы также имеем некоторые правила, которые ``black`` не покрывает. Это включает:
uk_ua: Крім того, у нас також є правила, які ``black`` не покриває. До них відносяться:

source: Imports
ru: Импорты
uk_ua: Імпорти

source: We have ``isort`` and ``pycln`` for imports control. The first used for sorting imports, and second, to remove unused imports. All other rules are not covered by linters/formatters etc. You should check those yourself.
ru: У нас есть ``isort`` и ``pycln`` для контроля импортов. Первая утилита используется для сортировки импортов, а вторая для удаления не используемых импортов. Все остальные правила не покрываются линтерами/форматерами или чем либо еще. Вы должны следить за этим сами.
uk_ua: Для контролю імпортів у нас є ``isort`` та ``pycln``. Перший використовується для сортування імпортів, а другий - для видалення імпортів, що не використовуються. Всі інші правила не покриваються лінтерами/форматерами тощо. Ви повинні перевіряти їх самостійно.

source: You should use ``import module`` and ``from package import module`` whenever it's possible, but sometimes ``from module import ...`` way is more useful. For example:
ru: Вам лучше использовать ``import module`` и ``from package import module``\ , где это возможно, но иногда стиль ``from module import ...`` бывает более полезен. Например:
uk_ua: Вам слід використовувати ``import module`` і ``from package import module``, коли це можливо, але іноді більш корисним є шлях ``from module import ...``. Наприклад:

source: If you're using only one variable from a module, and it's readable without its parent name, you should use ``from module import ...``. But if you're using many variables from module, better would be ``import module``\ /\ ``from package import module``\ :
ru: Если вы используете только одну переменную из модуля, и она читаема без имени этого модуля, вам следует использовать ``from module import ...``. Но если вы используете много переменных из модуля, лучше использовать ``import module``\ /\ ``from package import module``\ :
uk_ua: Якщо ви використовуєте тільки одну змінну з модуля, і добре зрозуміло її сенс без імені цього модуля, то слід використовувати ``from module import ...``. Але якщо ви використовуєте багато змінних з модуля, то краще буде ``import module``\ /\ ``from package import module``\ :

source: And can you use ``as``\ ? You must not use ``as`` when alias will be the same as actual name because in that way type checker add import statement to auto-generated ``__all__`` variable.
ru: И можете ли вы использовать ``as``? Вы должны не использовать когда псевдоним будет таким же, как и оригинальное имя, потому что таким образом инструмент проверки типов добавляет оператор импорта в автоматически сгенерированную переменную ``__all__``.

source: You maybe notice that ``import module`` and ``from package import module`` are written with ``/``\ , this is because you must use first one, if no package exist. But if there is a package - you must use ``from package import module``. Look at these examples:
ru: Возможно, вы заметили, что ``import module`` и ``from package import module`` написаны с ``/``\ , это потому, что вы должны использовать первый способ, если нет пакета (package). Но если пакет существует - вы должны использовать ``from package import module``. Посмотрите на эти примеры:
uk_ua: Ви могли помітити, що ``import module`` і ``from package import module`` написані через ``/``\ . Це тому, що ви повинні використовувати перший підхід, якщо немає пакета (package). Але якщо пакет є - потрібно використовувати ``from package import module``. Подивіться на ці приклади:

source: Notice that there aren't any relative imports, you can't use it here.
ru: Обратите внимание, что здесь нет относительных импортов, вы не можете использовать его у нас.

source: Also, you must specify ``__all__`` variable in all ``__init__.py`` files with any code (not one docstring). Reason of this limitation is that ``pycln`` and docs can't know exactly, do you want to add imports as alias, or this import is for using in code which in this file. ``pycln`` will ignore these imports, and docs will duplicate documentation for anything that you will import.
ru: Кроме того, вы должны указать переменную ``__all__`` во всех файлах ``__init__.py`` с любым кодом (не одной строкой документации). Причина этого ограничения в том, что ``pycln`` и документация не могут точно знать, хотите ли вы добавить импорт как псевдоним или импортируете для использования в коде, который находится в этом файле. ``pycln`` проигнорирует эти импорты, а документы будут дублировать документацию для всего, что вы будете импортировать.
uk_ua: Також у всіх файлах ``__init__.py`` з будь-яким кодом (не одним doc-рядком) необхідно вказувати змінну ``__all__``. Причиною цього обмеження є те, що ``pycln`` і документація не можуть точно знати, чи ви хочете додати імпорт як псевдонім, чи цей імпорт призначений для використання в коді, який знаходиться в цьому файлі. ``pycln`` проігнорує цей імпорт, а документація продублює документацію для всього, що ви імпортуєте.

source: Docstrings
ru: Док-строки
uk_ua: Док-рядки

source: We're using ``flake8`` for checking docstrings presence and their quality. They later in API documentation. You must write docstrings everywhere, except ``__init__`` methods (not the same as ``__init__.py`` files) because those will not go to documentation.
ru: Мы используем ``flake8`` для проверки наличия док-строк и их качества. Позже они появятся в документации API. Вы должны писать док-строки везде, кроме методов ``__init__`` (не то же самое, что файлы ``__init__.py``), потому что они не попадут в документацию.
uk_ua: Ми використовуємо ``flake8`` для перевірки наявності та якості рядків документів. Вони пізніше з'являться в документації API. Ви повинні писати док-рядки всюди, крім методів ``__init__`` (не те саме, що ``__init__.py`` файли), тому що вони не потраплять до документації.

source: I also recommend reading `Google styleguide about docstrings <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_ because we're using Google style in docstrings.
ru: Я также рекомендую прочитать `гайд по стилю Google про док-строки <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_, потому что мы используем стиль Google в док-строках.
uk_ua: Я також рекомендую прочитати `гайд по стилю Google про док-рядки <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_\ , оскільки ми використовуємо стиль Google у док-рядках.

source: Markup
ru: Разметка
uk_ua: Розмітка

source: Because of Sphinx's limitations, we must use ReST markup in docstrings. This allows us to use cross-references to other functions or even projects.
ru: Из-за ограничений Sphinx мы должны использовать разметку ReST в док-строках. Это позволяет нам использовать перекрестные ссылки на другие функции или даже проекты.
uk_ua: Через обмеження Sphinx ми вимушені використовувати розмітку ReST у doc-рядках. Це дозволяє нам використовувати перехресні посилання на інші функції або навіть проєкти.

source: Read more about `ReST markup <https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html>`_ and `Sphinx's cross-references <https://docs.readthedocs.io/en/stable/guides/cross-referencing-with-sphinx.html>`_.
ru: Подробнее о `ReST разметке <https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html>`_ и `перекрестных ссылках Sphinx <https://docs.readthedocs.io/en/stable/guides/cross-referencing-with-sphinx.html>`_.
uk_ua: Докладніше про `розмітку ReST <https://www.sphinx-doc.org/en/master/usage/restructuredtext/basics.html>`_ і `перехресні посилання у Sphinx <https://docs.readthedocs.io/en/stable/guides/cross-referencing-with-sphinx.html>`_.

source: ``__init__.py`` docstrings
ru: Док-строки в ``__init__.py``
uk_ua: Док-рядки у ``__init__.py``

source: They describe a package (folder) with modules (\ ``.py`` files).
ru: Они описывают пакет (папку, package) с модулями (\ ``.py`` файлы, modules).
uk_ua: Вони описують пакет (теку, package) з модулями (\ ``.py`` файлами, modules).

source: Module, function, class, method based docstrings
ru: Док-строки в модулях, функциях, классах и методах
uk_ua: Док-рядки у модулі, функції, класі та методі

source: It is a short description of an item. They must follow `Google styleguide about docstrings <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_.
ru: Это краткое описание элемента. Они должны соответствовать `гайду по стилю Google про док-строки <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_.
uk_ua: Це короткий опис елемента. Вони повинні відповідати `гайду по стилю Google про док-рядки <https://google.github.io/styleguide/pyguide.html#s3.8-comments-and-docstrings>`_.

source: Variable-based docstrings
ru: Док-строки в переменных
uk_ua: Док-рядки у змінних

source: They must follow in format:
ru: Они должны идти в формате:
uk_ua: Вони повинні бути у форматі:

source: This applies for the module level, and class attributes in `dataclasses <https://docs.python.org/3/library/dataclasses.html>`_\ /classes generated by `attrs <https://pypi.org/project/attrs/>`_. This won't work in ``__init__`` methods because they don't actually go to documentation. Attributes should be documented in class-based docstring, in ``Attributes`` section.
ru: Это относится к уровню модуля и атрибутам классов в `датаклассах <https://docs.python.org/3/library/dataclasses.html>`_\ /классах, генерируемых `attrs <https://pypi.org/project/attrs/>`_. Это не будет работать в методах ``__init__``, потому что они не попадают в документацию. Атрибуты должны быть задокументированы в док-строках на основе класса, в секции ``Attributes``.
uk_ua: Це стосується рівня модуля та атрибутів класів у `дата-классах <https://docs.python.org/3/library/dataclasses.html>`_\ /класах, створених за допомогою `attrs <https://pypi.org/project/attrs/>`_. Це не буде працювати в методах ``__init__``, оскільки вони насправді не попадають в документацію. Атрибути повинні бути задокументовані у док-рядках класів, у розділі ``Attributes``.

source: At now, linter doesn't detect them. Better sometimes check that all in API documentation actually documented.
ru: В настоящее время линтер не обнаруживает их. Лучше иногда проверять, что все в документации API действительно задокументировано.
uk_ua: Наразі лінтер це не перевіряє. Краще іноді дивитися, чи все у документації до API дійсно задокументовано.

source: In this file, we configure **only** ``poetry`` (except for ``black``\ , it supports only ``pyproject.toml`` file for configuration).
ru: В этом файле мы настраиваем **только** ``poetry`` (за исключением ``black``\ , который поддерживает только файл ``pyproject.toml`` для настройки).
uk_ua: У цьому файлі ми налаштовуємо **лише** ``poetry`` (окрім ``black``, він підтримує для налаштування лише файл ``pyproject.toml``).

source: Groups
ru: Группы
uk_ua: Групи

source: Since ``poetry`` 1.2 a new feature appeared - groups. It allows downloading only those groups of packages, which you will need. We have four groups - ``make``\ , ``tests``\ , ``docs`` and ``github_hooks``. Every of them answers about their function with name.
ru: Начиная с версии ``poetry`` 1.2 появилась новая возможность - группы. Она позволяет загружать только те группы пакетов, которые вам понадобятся. У нас есть четыре группы - ``make``\ , ``tests``\ , ``docs`` и ``github_hooks``. Каждая из них рассказывает про свою функцию названием.
uk_ua: Починаючи з ``poetry`` 1.2 з'явилася нова функція - групи. Вона дозволяє завантажувати тільки ті групи пакунків, які вам знадобляться. У нас є чотири групи - ``make``\ , ``tests``\ , ``docs`` і ``github_hooks``. Кожна з них відповідає своєю назвою про своє призначення.

source: ``make``\ : All required dependencies for `make test <#make-test>`_.
ru: ``make``\ : Все необходимые зависимости для `make test <#make-test>`_.
uk_ua: ``make``\ : Всі необхідні залежності для `make test <#make-test>`_.

source: ``tests``\ : All required dependencies for tests.
ru: ``tests``\ : Все необходимые зависимости для тестов.
uk_ua: ``tests``\ : Всі необхідні залежності для тестів.

source: ``docs``\ : All required dependencies for building documentation.
ru: ``docs``\ : Все необходимые зависимости для постройки документации.
uk_ua: ``docs``\ : Всі необхідні залежності для будування документації.

source: ``github_hooks``\ : All required dependencies for GitHub hooks.
ru: ``github_hooks``\ : Все необходимые зависимости для GitHub hooks.
uk_ua: ``github_hooks``\ : Всі необхідні залежності для GitHub hooks.

source: Please see `Managing dependencies in poetry <https://python-poetry.org/docs/master/managing-dependencies/>`_.
ru: Пожалуйста, смотрите `Управление зависимостями в poetry <https://python-poetry.org/docs/master/managing-dependencies/>`_.
uk_ua: Будь ласка подивіться `Керування залежностями у poetry <https://python-poetry.org/docs/master/managing-dependencies/>`_.

source: Versions
ru: Версии
uk_ua: Версії

source: All versions must follow in format ``X.Y.z`` (absolute version) or (\ ``~X.Y``\ ). Last one will compile in ``>=X.Y.0,<X.Y+1.0``. So for example we have last version for abstract dependency ``1.2.3``\ , we specify its version to ``~1.2``\ , so it will compile to ``>=1.2.0,<1.3.0`` (any patch version for ``1.2`` is accepted, but not ``1.3``\ +). If ``1.3.0`` will be released - dependabot will create PR for it.
ru: Все версии должны следовать в формате ``X.Y.z`` (абсолютная версия) или (\ ``~X.Y``\ ). Последний способ будет компилироваться в формат ``>=X.Y.0,<X.Y+1.0``. Например, у нас есть последняя версия для абстрактной зависимости ``1.2.3``\ , мы указываем ее версию ``~1.2``\ , поэтому она будет компилироваться в ``>=1.2.0,<1.3.0`` (принимается любая версия патча для ``1.2``, но не ``1.3``\ +). Если ``1.3.0`` будет выпущен - dependabot создаст PR для него.
uk_ua: Всі версії повинні слідувати у форматі ``X.Y.z`` (абсолютна версія) або (\ ``~X.Y``\ ). Останній варіант буде компілюватися у вигляді ``>=X.Y.0,<X.Y+1.0``. Наприклад, ми маємо останню версію для абстрактної залежності ``1.2.3``\ , ми повинні вказати версію ``~1.2``\ , тоді вона скомпілюється у ``>=1.2.0,<1.3.0`` (приймається будь-яка версія латки (patch) для ``1.2``, але не ``1.3``\ +). Якщо буде випущено ``1.3.0`` - dependabot створить для цього PR.

source: Read more `about Semantic Versions <https://semver.org/>`_ and `Dependency specification in poetry <https://python-poetry.org/docs/master/dependency-specification/>`_.
ru: Подробнее `о Semantic Versions <https://semver.org/>`_ и `спецификации зависимостей в poetry <https://python-poetry.org/docs/master/dependency-specification/>`_.
uk_ua: Детальніше `про Semantic Versions <https://semver.org/>`_ та `специфікацію залежностей у poetry <https://python-poetry.org/docs/master/dependency-specification/>`_.

source: Translations
ru: Переводы
uk_ua: Переклади

source: If you don't know languages which we support - left translation on us.
ru: Если вы не знаете языков, которые мы поддерживаем - предоставьте перевод нам.
uk_ua: Якщо ви не володієте мовами, які ми підтримуємо - залиште переклад на нас.

source: To update ``.po`` files run ``make translate``\ , after that, you can edit translations in ``.po`` files, which can be found as ``locales/<language's tag>/LC_MESSAGES/messages.po`` or ``locale/<language's tag>/LC_MESSAGES/`` in docs. After editing, for compilation, you can run one more time ``make translate`` (or ``make html`` in docs).
ru: Для обновления ``.po`` файлов запустите ``make translate``\ , после чего вы сможете редактировать переводы в ``.po`` файлах по пути ``locales/<тэг языка>/LC_MESSAGES/messages.po`` или ``locale/<тэг языка>/LC_MESSAGES/`` в документации. После редактирования, для компиляции можете еще раз запустить ``make translate`` (или ``make html`` в документации).
uk_ua: Для оновлення ``.po`` файлів використайте ``make translate``\ , після цього ви можете редагувати ``.po`` файли, які можуть бути знайдені як ``locales/<тег мови>/LC_MESSAGES/messages.po`` або ``locale/<тег мови>/LC_MESSAGES/`` у документації. Після редагування, для компіляції ви можете запустити ще один раз ``make translate`` (або ``make html`` у документації).

source: To add new language, use ``pybabel init -i locales/base.pot -l <language's tag> -d locales`` or ``sphinx-intl update -l <language's tag>`` for docs.
ru: Для добавления нового языка используйте ``pybabel init -i locales/base.pot -l <тэг языка> -d locales`` или ``sphinx-intl update -l <тэг языка>`` для документации.
uk_ua: Для додавання нової мови, використайте ``pybabel init -i locales/base.pot -l <тег мови> -d locales`` або ``sphinx-intl update -l <тег мови>`` для документації.

source: P.S. Language's tag it is short name of this language, example ``en`` or ``en_EN``. A full list of supported languages can be found with ``pybabel --list-locales``.
ru: P.S. Тэг языка это короткое его название, например ``en`` или ``en_EN``. Полный список вы можете посмотреть запустив ``pybabel --list-locales``.
uk_ua: P.S. Тег мови це коротке ім'я цієї мови, наприклад ``en`` або ``en_EN``. Повний список мов які підтримуються може бути знайдений за допомогою ``pybabel --list-locales``.

source: Documentation
ru: Документация
uk_ua: Документація

source: We use Sphinx for documentation and `docstrings <#docstrings>`_ for API documentation. At now, there is no actual styles here, except ``doc8``.
ru: Мы используем Sphinx для документации и `док-строки <#docstrings>`_ для документации API. На данный момент здесь нет никаких актуальных стилей, кроме ``doc8``.
uk_ua: Ми використовуємо Sphinx для документації та `док-рядки <#docstrings>`_ для документації API. Наразі тут немає ніяких правил та перевірок, окрім ``doc8``.

source: Other Help
ru: Другая Помощь
uk_ua: Інша допомога

source: You can contribute by spreading a word about this library. It would also be a huge contribution to write a short article on how you are using this project. You can also share your best practices with us.
ru: Вы можете помочь проекту распространяя информацию о нём. Так же большой поддержкой будет, например, написание короткой статьи о том как вы используете этот проект. Вы также можете делаться своими практиками с нами.
uk_ua: Ви можете допомогти розповсюдженням слова про цю бібліотеку. Також було б великою допомогою написати маленьку статтю як ви використовуєте цей проєкт. Ви також можете поділитися кращими практиками з нами.

source: Notice that there aren't any relative imports, you can't use it here. However, you can use ``as``.
uk_ua: Зверніть увагу, що тут немає ніякого відносного імпорту, ви не можете його використовувати у нас. Однак ви можете використовувати ``as``.
